[
  {
    "id": 6,
    "title": "Illumin Escape",
    "publishingDate": "2023-11-18",
    "author": "Ben Couser",
    "summary": "In this article, I share insights into the development of 'Illumin Escape', a 2D side scroller game with a unique twist. I discuss my initial concept, the progress I've made, challenges in graphics and animation, and my vision for the future of the game.",
    "mainBody": "<hr>\n<h2>The Initial Idea</h2>\n<p>Embarking on my first solo game development project, I aimed for a manageable scope, deciding on a 2D side scroller game with a dark and creepy aesthetic. The game, influenced by 'Don’t Starve', involves a character with a limited sanity meter.</p>\n<h2>Progress to Date</h2>\n<ul>\n  <li>Spotlights that track the player and restore the sanity bar.</li>\n  <li>Player movement and respawning mechanics for when the sanity meter depletes.</li>\n  <li>A shadow enemy that patrols back and forth on its platform, reminiscent of a Koopa.</li>\n  <li>A red-eyed shadow enemy that floats near its spawn point, entering a lock-on state when the player is near, followed by a fast attack.</li>\n  <li>A tank enemy with back-and-forth movement, for which I'm still contemplating unique mechanics.</li>\n</ul>\n<h2>Animation and Graphics</h2>\n<p>Initially, I utilized DALLE for sprite creation. However, to elevate the game, I explored Krita, as recommended by my sister, a graphics student. Despite the steep learning curve and initial frustrations, I recognize the importance of this skill for game development. As an alternative, I'm considering a shift to pixel art, which seems more accessible and fitting for the indie game aesthetic.</p>\n<h2>What's Next?</h2>\n<p>Looking ahead, I want to add unique features to set 'Illumin Escape' apart. One idea is to leverage the sanity meter for speedrunning challenges. The game's evolving theme around mental health, highlighted through its light and dark elements, inspires me to incorporate mental health-themed mini-games into the respawning process. These would not only add depth to the gameplay but also introduce a random element, potentially enhancing the speedrunning experience.</p>"
  },  
  {
    "id": 5,
    "title": "Game Development with Unity and C#",
    "publishingDate": "2023-11-02",
    "author": "Ben Couser",
    "summary": "Here I talk about some of the methods I will be attempting to make money with. Ranging from content creation using GPT to developing new coding skills entirely in order to make games.",
    "mainBody": "<hr>\n<h2>Introduction</h2>\n<p>As discussed in my previous article, <em>This Time Next Year</em>, I am looking to increase the number of revenue streams I have. After some time to think, I decided to persue indie game development. The reason for this being my previous coding experience and general interest in this topic (I am quite shocked I have never tried something like this before). After some research it seemed as if I had two options, Unity or Unreal. I went with Unity because C# was a language I had always wanted to use, and could also translate over to my work with RPA (UiPath now support C# in their automations). With my game engine chosen, I decided that it was worth finding a tutorial video on youtube that could walk me through a basic game development and explain the basics of Unity. The resource I chose was <a href='https://www.youtube.com/watch?v=AmGSEH7QcDg'>Learning Unity Beginner/Intermediate</a>. The structured approach of the video eased me in at a beginner level and slowly transitioned to more and more complex topics.</p>\n<h2>Lessons and Next Steps</h2><p>A mistake I see people make often is getting stuck in tutorial purgatory. You follow along with video after video, making the same scripted errors the teacher planned and certainly not thinking for yourself. I know I have fallen into this trap many times before. The tutorial has given me a framework and now I intend to use it by making a game by myself. To keep complexity low I will be making a 2d platformer game. Although this is a very basic idea, I am using this game simply to solidify knowledge. Implementing things like movement, collisions and basic game goals are vital for any project. This game is simply a stepping stone before I add complexity and unique mechanics. I will keep this blog updated with all progress I make.</p>\n<p>In the future, I plan to write articles on both Unity and C#. If you want to learn about game developement then make sure you look out for that!</p>"
  },
  {
    "id": 4,
    "title": "This Time Next Year",
    "publishingDate": "2023-09-18",
    "author": "Ben Couser",
    "summary": "Here I talk about some of the methods I will be attempting to make money with. Ranging from content creation using GPT to developing new coding skills entirely in order to make games.",
      "mainBody": "<hr>\n<h2>Introduction</h2>\n<p>Over the last year or so I have been thinking more and more about how I can improve my income. One of the key lessons taught in ‘The Almanack of Naval Ravikant’ is to find a position of leverage and utilise that for the economic rewards. You often hear many financial ‘gurus’ saying that they know they key to financial freedom, that key being drop shipping. That has never connected with me and I feel Navals sentiment is the reason for that. Spending years of my life now studying physics and computer science, I need to find that leverage I have gained with these skills. The following is a list of a few ideas I have thought of recently, I hope one gives you the spark to try something new./p>\n<h2>Social Media Content Creation</h2>\n<p>In the land of LinkedIn I have come across what seems like an infinite amount of small businesses that have left their pages to rot. Only to be used once every January when the admin vows to be more active and give the company more exposure, soon to be forgotten. In the advent of the GPT revolution, I had the idea to create a business that would go and sell generated content through prompt engineering. It would be a subscription based transaction and most likely cost a fraction of the time taken themselves to think of the content. My initial thought would be £5 per 10 posts a month. The market is there but I am unsure if I would enjoy this enough to spend a considerable amount of time on it.</p>\n<h2>Ebay Auto-Buyer</h2>\n<p>I have been working as an automation developer now since the start of 2020 and feel there could be a good chance of catching cheap deals this way. In my mind what I would do is first pick out a valuable type of product, create an automation to scour a site like eBay for a good deal, use a computer vision model that would check the product is what I think it is and then once the item is bought, sell it on for profit. Although this does sound promising, I can’t imagine that I am the only one attempting it. Also, you never truly know if you will get what you paid for on that website, especially when trying to get a product for a steal.</p>\n<h2>Game Development</h2>\n<p>In recent times I have dipped my toe into working with the Unity game engine. I have always wanted to try working with C# code and really do love the idea of developing my own games. Although it is an extremely oversaturated market, I feel this could be the most rewarding out of all the options. Although I am not technically experienced in this field, I know the skills I have developed will translate over. This potentially could generate a great form of passive income if I have the nerve to stick with it and get over this initial learning curve.</p><h2>Climbing Mountains</h2><p>As the title suggests, this time next year I will be a millionaire (hopefully). Obviously, that is a play on the Only Fools and Horses line, but I want to be able to look back on this article in a years time and know that I tried. Maybe the methods I described above are not what I end up pursuing but you need to try things first in order to know where you went wrong. The analogy of a man at the bottom of a mountain range is my favourite here. At the bottom the man cannot tell which peak climbs highest, so he picks a hill and start climbing. Once he was high enough, he realised that this is not the correct path he was searching for. Some would say the man wasted his time climbing the wrong hill but without the new vantage point he would never know which way he was meant to go. One day I will find the mountain to climb.</p>"
  },
  {
    "id": 3,
    "title": "Websites and Words",
    "publishingDate": "2023-09-03",
    "author": "Ben Couser",
    "summary": "A discussion on how the website was made and how I plan to use it",
    "mainBody": "<hr>\n<h2>Introduction</h2>\n<p>Although I have an competent level of programming experience, I do not know a thing about web development! Building a website has always looked like a daunting task to me and I have never actually found a need to do so. In August 2023, I decided to challenge myself by setting the task of creating a website that will be put into production. The next issue at hand was deciding what on earth should I use this website for?</p>\n<h2>A Hammer Looking for a Nail</h2>\n<p>Now with the goal set in mind, I needed purpose. I would never want to do something that I felt could not benefit me in the future. When I began my research into developing machine learning solutions, I did so with the intent of getting a job in said field, the fastest growing in the world. My short stint of working on hardware solutions was for the soul purpose of making a device that could close my bedroom window in the morning remotely, when birds outside would make a ridiculous level of noise and stop me from sleeping. The actual inspiration for making a website that could host articles is from Chris Williamson, the host of <a href='https://chriswillx.com/podcast/'>Modern Wisdom</a> and publisher of the 3 Minute Monday news letter. The news letter particularly demonstrates the craft of distilling ideas down in to short, easy to consume, nuggets of information that you can use in daily life. This is a skill that I have decided I want to develop and thus the website was born.</p>\n<h2>How do I Make a Website?</h2>\n<p>With little to no web development experience under my belt, I turned to <a href='https://chat.openai.com/'>ChatGPT</a> for assistance. If anyone is actually reading this article I am going to assume that you know what ChatGPT is, a quick summary is that it is a platform where you ask questions and a machine learning model provides you with the answer. I started the process by simply asking 'I would like to create a website that will be used for my cv and articles posting, what steps do we need to take in order to make it?', from this point it provided me with an eight step guide, explaining in detail all the steps that take an idea into reality. Although the process was in no way easy, other information sources were needed in certain times, the productivity boost it provided was immeasurable. I decided in the end to use no libraries or frameworks in the creation process. This decision was made due to two major reasons. Firstly, I have previously tried using Angular with a friend to develop my skills and found that the framework added complexity that was simply not needed for such a small project. Secondly, ChatGPT is trained on past data, thus my theory was that it might be unable to keep up with new releases and provide out of date code. Wether or not this decision was the correct one, only time will tell.</p>\n<h2>Thoughts and Next Steps</h2>\n<p>The website is now published and the dust has finally settled. What's next? I not going take this project too seriously, I simply want to add articles from time to time on here when I find something intersting. The process to get here has been long but relatively painless. Hopefully, in the future, I will try to incorporate machine learning into the website. I'm yet to decide what or how but I will be sure to write about it so that anyone can follow along if they want to give something new a go. Stay tuned for more upcoming articles that weren't generated by ChatGPT (although I feel I must keep the original 3 here, I have grown too fond of them). I hope this has inspired someone to take the plunge and try something new, the biggest regrets in life are of that you did not pursue.</p>"
  },
  {
    "id": 2,
    "title": "The Game of Chess",
    "publishingDate": "2023-09-01",
    "author": "Ben Couser",
    "summary": "A GPT generated article on the basic rules of chess. Made for testing reasons",
    "mainBody": "<hr>\n<h2>Introduction</h2>\n<p>Chess is a two-player strategy board game that has been played for centuries. It involves a 64-square board and 16 pieces for each player. The objective is simple: checkmate your opponent's king. However, the strategies that can be employed are almost endless, making it a complex and fascinating game.</p>\n<h2>History</h2>\n<p>The origins of chess can be traced back to the 6th century in India, where it was known as <em>Chaturanga</em>. The game spread to Persia, and eventually to the Islamic world and Europe.</p>\n<h2>Basic Rules</h2>\n<ul>\n  <li>Each player starts with 16 pieces: one king, one queen, two rooks, two knights, two bishops, and eight pawns.</li>\n  <li>The board should be oriented so that each player has a white square in the bottom right corner.</li>\n  <li>Players take turns moving one piece at a time.</li>\n  <li>The game ends when a player's king is checkmated or a stalemate is reached.</li>\n</ul>\n<h2>Strategies</h2>\n<p>There are countless strategies and openings in chess, ranging from the Sicilian Defense to the Queen's Gambit. As players gain experience, they often delve deeper into these strategies to gain an edge over their opponents.</p>\n<h2>Conclusion</h2>\n<p>Chess is a game of endless possibilities and challenges. Whether you are a beginner or a grandmaster, there is always something new to learn and explore.</p>"
  },
  {
    "id": 1,
    "title": "Crime and Punishment",
    "publishingDate": "2023-08-21",
    "author": "Ben Couser",
    "summary": "A GPT generated article on the book Crime and Punishment. Made for testing reasons",
    "mainBody": "\n<p>Published on <em>2023-09-15</em></p>\n<hr>\n<h2>Introduction</h2>\n<p>'Crime and Punishment' is a classic novel written by Fyodor Dostoevsky in 1866. The book delves into the complexities of morality, justice, and the human psyche, making it a must-read for anyone interested in literature or philosophy.</p>\n<h2>Plot Summary</h2>\n<p>The story revolves around Rodion Raskolnikov, a young man who believes he is destined for great things. To prove his point and alleviate his family's financial burdens, he commits a murder, rationalizing it as a necessary evil. The rest of the book explores the psychological torment he experiences as a result.</p>\n<h2>Themes</h2>\n<ul>\n  <li>Morality and Justice: The book explores the complexities of right and wrong, examining how individuals rationalize their actions.</li>\n  <li>Alienation: Raskolnikov's internal struggles lead him to isolate himself, serving as a broader commentary on the human condition.</li>\n  <li>Social Critique: The story is also a critique of the societal conditions that lead people to commit desperate acts.</li>\n</ul>\n<h2>Impact"
  },
  {
    "id": 0,
    "title": "The Myth",
    "publishingDate": "2023-08-20",
    "author": "Ben Couser",
    "summary": "A GPT generated article on the book The Myth of Sisyphus. Made for testing reasons",
    "mainBody": "\n<h2>The Myth</h2>\n<p>Sisyphus, a cunning king, is punished by the gods for his deceitfulness. His punishment is to roll a boulder up a hill, only to have it roll back down when he reaches the top, for all eternity.</p>\n<h2>Interpretations</h2>\n<ul>\n  <li><strong>Existentialism:</strong> Albert Camus famously interpreted the myth as an allegory for the human condition. He argued that life is absurd, yet we must continue to find meaning in our struggles.</li>\n  <li><strong>Futility:</strong> Some see the myth as a representation of the futility of human endeavors, where effort does not always result in achievement.</li>\n  <li><strong>Hope and Perseverance:</strong> Others interpret the myth as a lesson in hope and perseverance, highlighting the human capacity to endure.</li>\n</ul>\n<h2>Impact</h2>\n<p>The Myth of Sisyphus continues to be a subject of study and interpretation in various disciplines, including philosophy, literature, and psychology. Its universal themes make it relevant across cultures and eras.</p>\n<h2>Conclusion</h2>\n<p>The Myth of Sisyphus serves as a rich tapestry for exploring the complexities of human existence. Whether you see it as a tale of futility or a lesson in resilience, the story holds valuable insights into the nature of life and the human spirit.</p>"
  }
]
